/*
问题描述
刚进入大学的新生需要一段时间来熟悉新的学习和生活环境。为了帮助新
生顺利度过这段适应期，学校推出了“新生保护计划”，并为每位新生设
置了一段保护期。
保护期开始时，学校会为每位新生设定一个正整数 n 作为初始保护值。
保护期内，系统每天都会对当前保护值进行一次处理。
处理规则如下：系统查看当前保护值的十进制表示，将其中每一位数字
相加，然后用当前保护值减去这个和。
例如，当前保护值为 2026 时，各位数字之和为 2+0+2+6=10，处理后
保护值变为 2016。
每天处理一次后，如果保护值仍为正数，保护期就继续；当保护值变为 
0 时，保护期结束。
现在给定一名新生的初始保护值 n，请你计算这名新生的保护期一共可
以持续多少天。

输入格式
输入一行，包含一个正整数 n（1≤n≤10^6），表示新生的初始保护值。

输出格式
输出一个整数，表示新生保护期可以持续的天数。
*/
#include <stdio.h>
#include <stdlib.h>

int protect(int n){
    int temp = n;
    while (temp>0){
        n -= (temp % 10);
        temp /= 10;
    }
    return n;
}

int main(void){
    int n;
    scanf("%d",&n);
    int day=0;
    while(n>0){
        n = protect(n);
        day++;
    }
    printf("%d",day);

    return 0;
}