/*
问题描述
蓝桥学院的地下管线出现了故障。为了尽快找到故障位置，小蓝决定让
巡线机器人沿着管道进行巡检。
管道是一条无限延伸的格子轨道，机器人从 0 号格子出发。巡检时，机
器人会按照一串指令移动，其中 L 表示向左移动一格，R 表示向右移动
一格，S 表示停留在原地。
然而，一场突如其来的暴雨导致部分指令的传输数据损坏，这些指令只
能被记为 ?。为了保证巡检能够顺利进行，维修人员需要将每个 ? 修复
为 L、R 或 S。
机器人经过的格子都会被记录为已经巡检过，包括出发时所在的 
0 号格子。为了让一次巡检能够覆盖更多管线区域，小蓝希望选择合适
的修复方式，使机器人最终经过的不同格子尽可能多。
对此，请你计算，在最优修复方案下，机器人最多能够巡检多少个不同
的格子。

输入格式
输入一行，包含一个仅由 L、R、S、? 组成的字符串 T
（1≤∣T∣≤10^5）。

输出格式
输出一个整数，表示机器人最多能够巡检的不同格子数量。
*/
#include <stdio.h>

int main(void) {
    int f = 0, q = 0;
    int minA = 0, maxB = 0;
    int ans = 0;
    int c;
    while ((c = getchar()) != EOF && c != '\n') {
        if (c == 'L') --f;
        else if (c == 'R') ++f;
        else if (c == '?') ++q;
        int A = f + q;
        int B = f - q;
        if (A - minA > ans) ans = A - minA;
        if (maxB - B > ans) ans = maxB - B;
        if (A < minA) minA = A;
        if (B > maxB) maxB = B;
    }
    printf("%d\n", ans + 1);
    return 0;
}