/*
问题描述
新学期开始后，蓝桥学院为宿舍楼更换了一批全新的门禁锁。与普通的
数字密码锁不同，这批门禁锁的面板上只有两个按键：L 和 Q。
每个门禁码都是一个长度恰好为 N 的字符串，其中每一位只能是 L 或 
Q。例如，当 N=4 时，LQLQ、QQQL 都是可以被输入的门禁码。
小蓝在测试时发现，按键有时会因为被连续按下而卡住。如果门禁码中出
现连续三个完全相同的字符，门禁锁就会认为对应按键发生了故障，并
拒绝这个密码。
换句话说，合法的门禁码中不能出现子串 LLL 或 QQQ。=
小蓝需要为新生分配门禁码。在真正开始分配之前，他想知道：对于给
定的长度 N，一共能够生成多少个不同的合法门禁码。请你帮帮他。

输入格式
输入一行，包含一个整数 N（1≤N≤30），表示门禁码的长度。
*/
#include <stdio.h>

int main(void) {
    int n;
    scanf("%d", &n);

    if (n == 1) {
        printf("2\n");
        return 0;
    }
    long long f1 = 2, f2 = 4, fn = 4;
    for (int i = 3; i <= n; i++) {
        fn = f1 + f2;
        f1 = f2;
        f2 = fn;
    }
    printf("%lld\n", fn);
    return 0;
}