/*
问题描述
大学课程需要使用讲义，小蓝负责打印一份共有 N 页的材料。讲义采用双面
打印：第 1、2 页印在第一张纸的正反面，第 3、4 页印在第二张纸的正反
面，依此类推。如果最后只剩一页，就只印在最后一张纸的正面，背面留空。
检查时，小蓝发现第 L 页到第 R 页的内容没有印清楚，其余页面都没有问
题。他需要更换所有印有这些页面的纸张，并按原来的页码重新打印。
更换一张纸时，这张纸上的正常页面也需要重新打印；空白面不算页面。
请你帮助小蓝计算，需要补印多少张纸，以及有多少页原本正常的内容会被
一同重新打印。

输入格式
输入一行，包含三个整数 N,L,R（1≤L≤R≤N≤10^9），分别表示讲义总页数、
没有印清楚的起始页码和结束页码。

输出格式
输出两个整数，用一个空格分隔，分别表示需要补印的纸张数和一同重新打
印的正常页数。
*/
#include <stdio.h>

int main(void){
    long long n,l,r;
    scanf("%lld %lld %lld",&n,&l,&r);

    long long nomalNumber = 0;
    long long addNumber = 0;
    if(l%2==0){
        nomalNumber++;
    }else{
        l++;
    }
    if(r%2==1){
        if(r+1<=n){
            nomalNumber++;
        }
        r++;
    }
    addNumber = ((r-l)/2)+1;
    printf("%lld %lld\n",addNumber,nomalNumber);

    return 0;
}