/*
问题描述
蓝桥杯最近推出了一项团队赛模式，要求三人组队参赛，并规定其中一
人必须担任队长。队长的资格很简单：其程序设计能力值必须严格大于
其他两名队友程序设计能力值的总和。

小蓝、小桥和小杯正在考虑报名参加此次比赛。小蓝的程序设计能力值
为a，小桥为 b，小杯为 c。
他们想知道能否成功报名。如果可以成功报名，则输出队长的人选：如
果小蓝是队长，则输出 l；如果小桥是队长，则输出 q；如果小杯是队
长，则输出 b。

如果无法成功参赛，则输出 −1。

输入说明
输入三个整数 a,b,c(1≤a,b,c≤10^6 )，分别代表小蓝、小桥和小杯的
能力值。

输出格式
若可以参赛，则输出队长对应字符表示，否则输出 −1 表示无法参赛。
*/

#include <stdio.h>

void pd(int a,int b,int c){
    if(a>b+c){
        printf("l");
    }else if(b>a+c){
        printf("q");
    }else if(c>a+b){
        printf("b");
    }else{
        printf("-1");
    }
}

int main(void){
    int a,b,c;
    scanf("%d %d %d",&a,&b,&c);
    pd(a,b,c);

    return 0;
}