/*
小蓝正在玩一个游戏，游戏中小蓝要控制自己的三个英雄来攻击一个
敌人。敌人初始的血量为 2025。

小蓝的第一个英雄攻击力恒定，每回合攻击 5 的血量。

小蓝的第二个英雄拥有一些技能，奇数回合触发，攻击 15 的血量，
偶数回合攻击 2 的血量。

小蓝的第三个英雄拥有一些道具，当回合数除以 3 的余数为 1 时
攻击 2 的血量；当回合数除以 3 的余数为 2 时攻击 10 的血量；
当回合数除以 3 的余数为 0 时攻击 7 的血量。 

游戏从第 1 回合开始。不考虑敌人对小蓝英雄的攻击，敌人的血量
也仅受攻击的影响。如果敌人的血量小于等于零，则游戏结束。 

请问到第几回合游戏结束？
*/

#include <stdio.h>

int main(void){
    int hp = 2025;
    int t = 1;
    while(hp>0){
        hp-=5;
        if(t%2==1){
            hp-=15;
        }else{
            hp-=2;
        }
        if(t%3==1){
            hp-=2;
        }else if(t%3==2){
            hp-=10;
        }else{
            hp-=7;
        }
        t+=1;
    }
    printf("%d\n",t-1);

    return 0;
}